var tsnad = [
  ["ЭП-21 / 1", "над чертой"],
  [ // [предмет, препод, аудитория]
    ["--", "--", "--"], //понедельник
    ["п. Матан", "Авакян С.Л.", "2-324"],
    ["л. ЭТМ", "Грунтович Н.В.", "2-319"],
    ["п. ЭТМ", "Грунтович Н.В.", "2-313"],
    ["л. ТАУ", "Дорощенко И.В.", "2-229"],
  ],
  [
    ["--", "--", "--"], //вторник
    ["ФИЗРА", "--", "--"],
    ["л. Философия", "Савенко А.Ю.", "2-12"],
    ["л. ОМИПТ", "Логвин В.В.", "2-230"],
    ["п. ОМИПТ", "Логвин В.В.", "2-230"],
  ],
  [
    ["п. Экология", "Ходько Е.М.", "2-435"],
    ["л. ТОЭ", "Соленков В.В.", "2-14"],
    ["л. ТеорМех", "Гавриш В.Ю.", "1-428"],
    ["--", "--", "--"],
    ["--", "--", "--"],
  ],
  [
    ["л. Философия", "Савенко А.Ю.", "2-14"], //четверг
    ["п. ПрМех", "Иноземцева Н.В.", "1-427"],
    ["п. Физика", "Шаповалов П.С.", "2-504"],
    ["л. Экология", "Ходько Е.М.", "2-14"],
    ["--", "--", "--"],
  ],
  [
    ["л. Матан", "Авакян С.Л.", "2-11"], //пятница
    ["ФИЗРА", "--", "--"],
    ["п. Философия", "Савенко А.Ю.", "1-210"],
    ["п. Матан", "Авакян С.Л.", "2-324"],
    ["--", "--", "--"],
  ],
  [
    ["--", "--", "--"], //суббота
    ["--", "--", "--"],
    ["--", "--", "--"],
    ["--", "--", "--"],
    ["--", "--", "--"],
  ]
];

var tspod = [
  ["ЭП-11 / 1", "под чертой"],
  [ // [предмет, препод, аудитория]
    ["инфа вроде", "--", "1-503"], //понедельник
    ["п. Матан", "Авакян С.Л.", "2-324"],
    ["л. Физика", "Проневич О.И.", "2-21"],
    ["п. ТАУ", "Дорощенко И.В.", "2-218"],
    ["л. ТАУ", "Дорощенко И.В.", "2-229"],
  ],
  [
    ["п. Философия", "Савенко А.Ю.", "2-437"], //вторник
    ["ФИЗРА", "--", "--"],
    ["л. Философия", "Савенко А.Ю.", "2-12"],
    ["--", "--", "--"],
    ["--", "--", "--"],
  ],
  [
    ["--", "--", "--"], //среда
    ["л. ТОЭ", "Соленков В.В.", "2-14"],
    ["л. ТеорМех", "Гавриш В.Ю.", "1-428"],
    ["п. ТеорМех", "Гавриш В.Ю.", "1-427"],
    ["--", "--", "--"],
  ],
  [
    ["п. ТОЭ", "Соленков В.В.", "2-405"],
    ["п. ТОЭ", "Соленков В.В.", "2-405"], //четверг
    ["л. ПрМех", "Иноземцева Н.В.", "1-425"],
    ["п. Матан", "Авакян С.Л.", "2-324"],
    ["--", "--", "--"],
  ],
  [
    ["л. Матан", "Авакян С.Л.", "2-11"], //пятница
    ["ФИЗРА", "--", "--"],
    ["л. ТАУ", "Дорощенко И.В.", "2-230"],
    ["п. ТАУ", "Дорощенко И.В.", "2-230"],
    ["--", "--", "--"],
  ],
  [
    ["--", "--", "--"], //суббота
    ["--", "--", "--"],
    ["--", "--", "--"],
    ["--", "--", "--"],
    ["--", "--", "--"],
  ]
];
