var tsnad = [
  ["ЭП-31", "над чертой"],
  [ // [предмет, препод, аудитория]
    ["--", "", ""], //понедельник
    ["--", "", ""],
    ["л. ТЭП", "Савельев В.А.", "2-229"],
    ["л. ТЭП", "Савельев В.А.", "2-229"],
    ["п. ЭАЭП", "Погуляев М.Н.", "2-229"],
  ],
  [
    ["--", "", ""], //вторник
    ["л. ЭАЭП", "Погуляев М.Н.", "2-229"],
    ["ФИЗРА", "", ""],
    ["п. ТЭП", "Савельев В.А.", "2-118"],
    ["п. ТЭП", "Савельев В.А.", "2-118"],
  ],
  [
    ["п. МЭП", "Дорощенко И.В.", "2-223"],
    ["л. МЭП", "Дорощенко И.В.", "2-229"],
    ["п. МПСАЭП", "Савельев В.А.", "2-220"],
    ["л. МПСАЭП", "Савельев В.А.", "2-229"],
    ["--", "", ""],
  ],
  [
    ["л. ЭА", "Веппер Л.В.", "2-226"], //четверг
    ["п. ЭА", "Веппер Л.В.", "2-226"],
    ["ФИЗРА", "", ""],
    ["--", "", ""],
    ["--", "", ""],
  ],
  [
    ["л. СУЭП", "Логвин В.В.", "2-230"], //пятница
    ["п. СУЭП", "Логвин В.В.", "2-218"],
    ["п. РКСАЭП", "Веппер Л.В.", "2-226"],
    ["--", "", ""],
    ["--", "", ""],
  ],
  [
    ["--", "", ""], //суббота
    ["--", "", ""],
    ["--", "", ""],
    ["--", "", ""],
    ["--", "", ""],
  ]
];

var tspod = [
  ["ЭП-31", "под чертой"],
  [ // [предмет, препод, аудитория]
    ["--", "", ""], //понедельник
    ["--", "", ""],
    ["п. ЭАЭП", "Погуляев М.Н.", "2-220"],
    ["л. ТЭП", "Савельев В.А.", "2-229"],
    ["л. ЭАЭП", "Погуляев М.Н.", "2-229"],
  ],
  [
    ["--", "", ""], //вторник
    ["л. ЭАЭП", "Погуляев М.Н.", "2-229"],
    ["ФИЗРА", "", ""],
    ["л. МПСАЭП", "Савельев В.А.", "2-229"],
    ["п. ТЭП", "Савельев В.А.", "2-118"],
  ],
  [
    ["п. МЭП", "Дорощенко И.В.", "2-223"],
    ["л. МЭП", "Дорощенко И.В.", "2-229"],
    ["п. МПСАЭП", "Савельев В.А.", "2-220"],
    ["л. МПСАЭП", "Савельев В.А.", "2-229"],
    ["--", "", ""],
  ],
  [
    ["л. ЭА", "Веппер Л.В.", "2-226"], //четверг
    ["л. МЭП", "Дорощенко И.В.", "2-229"],
    ["ФИЗРА", "", ""],
    ["--", "", ""],
    ["--", "", ""],
  ],
  [
    ["л. СУЭП", "Логвин В.В.", "2-230"], //пятница
    ["л. РКСАЭП", "Веппер Л.В.", "2-226"],
    ["п. РКСАЭП", "Веппер Л.В.", "2-226"],
    ["п. СУЭП", "Логвин В.В.", "2-220"],
    ["--", "", ""],
  ],
  [
    ["--", "", ""], //суббота
    ["--", "", ""],
    ["--", "", ""],
    ["--", "", ""],
    ["--", "", ""],
  ]
];


/*var alarms = [
  [8, 00, 0],
  [9, 30, -1], //1

  [9, 45, 1],
  [11, 15, -1], //2

  [11, 25, 2],
  [12, 55, -1], //3

  [13, 25, 3],
  [14, 55, -1], //4

  [15, 05, 4],
  [16, 35, "undefined"] //5
];*/
