var tsnad = [
  ["ЭП-31", "над чертой"],
  [ // [предмет, препод, аудитория]
    ["--", "", ""], //понедельник
    ["п. ТЭТС", "Тодарев", "2-230"],
    ["п. ТЭП", "Савельев В.А.", "2-118"],
    ["л. ТЭП", "Савельев В.А.", "2-229"],
    ["--", "", ""],
  ],
  [
    ["--", "", ""], //вторник
    ["п. МЭП", "Дорощенко И.В.", "2-218"],
    ["ФИЗРА", "", ""],
    ["п. ЭПиТУ", "Тодарев В.В.", "2-230"],
    ["--", "", ""],
  ],
  [
    ["--", "", ""],
    ["л. ТЭТС", "Тодарев", "2-230"],
    ["п. СУЭП", "Логвин В.В.", "2-118"],
    ["л. СУЭП", "Логвин В.В.", "2-229"],
    ["--", "", ""],
  ],
  [
    ["--", "", ""], //четверг
    ["л. АЭПТПиТМ", "Брель", "2-230"],
    ["ФИЗРА", "", ""],
    ["л. ЭПиТУ", "Тодарев В.В.", "2-230"],
    ["--", "", ""],
  ],
  [
    ["л. ПДСУ", "Логвин В.В.", "2-230"], //пятница
    ["п. ПДСУ", "Логвин В.В.", "2-220"],
    ["лаб. ПКиПС", "Савельев В.А.", "2-234"],
    ["л. ПКиПС", "Савельев В.А.", "2-229"],
    ["--", "", ""],
  ],
  [
    ["--", "", ""], //суббота
    ["--", "", ""],
    ["--", "", ""],
    ["--", "", ""],
    ["--", "", ""],
  ]
];

var tspod = [
  ["ЭП-31", "под чертой"],
  [ // [предмет, препод, аудитория]
    ["--", "", ""], //понедельник
    ["п. ОснПрКпРБ", "Кацубо", "1-507а"],
    ["п. ТЭП", "Савельев В.А.", "2-118"],
    ["л. ТЭП", "Савельев В.А.", "2-229"],
    ["--", "", ""],
  ],
  [
    ["л. МЭП", "Дорощенко И.В.", "2-229"], //вторник
    ["п. МЭП", "Дорощенко И.В.", "2-218"],
    ["ФИЗРА", "", ""],
    ["л. ОснПрКпРБ", "Кацубо", "2-11"],
    ["--", "", ""],
  ],
  [
    ["п. АЭПТПиТМ", "Брель", "2-226"],
    ["л. ТЭТС", "Тодарев", "2-230"],
    ["п. СУЭП", "Логвин В.В.", "2-118"],
    ["л. СУЭП", "Логвин В.В.", "2-229"],
    ["--", "", ""],
  ],
  [
    ["--", "", ""], //четверг
    ["л. АЭПТПиТМ", "Брель", "2-230"],
    ["ФИЗРА", "", ""],
    ["л. ЭПиТУ", "Тодарев В.В.", "2-230"],
    ["п. ЭПиТУ", "Тодарев В.В.", "2-230"],
  ],
  [
    ["л. ПДСУ", "Логвин В.В.", "2-230"], //пятница
    ["п. ПДСУ", "Логвин В.В.", "2-220"],
    ["лаб. ПКиПС", "Савельев В.А.", "2-234"],
    ["л. ПКиПС", "Савельев В.А.", "2-229"],
    ["--", "", ""],
  ],
  [
    ["--", "", ""], //суббота
    ["--", "", ""],
    ["--", "", ""],
    ["--", "", ""],
    ["--", "", ""],
  ]
];


/*var alarms = [
  [8, 00, 0],
  [9, 30, -1], //1

  [9, 45, 1],
  [11, 15, -1], //2

  [11, 25, 2],
  [12, 55, -1], //3

  [13, 25, 3],
  [14, 55, -1], //4

  [15, 05, 4],
  [16, 35, "undefined"] //5
];*/
