var tsnad = [
  ["ЭП-31", "над чертой"],
  [ // [предмет, препод, аудитория]
    ["--", "", ""], //понедельник
    ["--", "", ""],
    ["л. ТЭП", "Савельев В.А.", "2-229"],
    ["л. ТЭП", "Савельев В.А.", "2-229"],
    ["п. ЭАЭП", "Погуляев М.Н.", "2-229"],
  ],
  [
    ["--", "", ""], //вторник
    ["л. ЭАЭП", "Погуляев М.Н.", "2-229"],
    ["ФИЗРА", "", ""],
    ["п. ТЭП", "Савельев В.А.", "2-118"],
    ["п. ТЭП", "Савельев В.А.", "2-118"],
  ],
  [
    ["п. МЭП", "Дорощенко И.В.", "2-223"],
    ["л. МЭП", "Дорощенко И.В.", "2-229"],
    ["п. МПСАЭП", "Погуляев М.Н.", ""],
    ["--", "", ""],
    ["--", "", ""],
  ],
  [
    ["лаб. ТОЭ", "Соленков В.В.", ""], //четверг
    ["пр. ТОЭ", "Соленков В.В.", ""],
    ["л. ППСТ", "Погуляев М.Н.", ""],
    ["л. ПрМех", "Иноземцева Н.В.", ""],
    ["пр. Экономика", "Савенко Т.В.", ""],
  ],
  [
    ["--", "", ""], //пятница
    ["--", "", ""],
    ["л. Экономика", "Савенко Т.В.", ""],
    ["л. Охрана труда", "Веппер Л.В.", ""],
    ["--", "", ""],
  ],
  [
    ["--", "", ""], //суббота
    ["--", "", ""],
    ["--", "", ""],
    ["--", "", ""],
    ["--", "", ""],
  ]
];

var tspod = [
  ["ЭП-31", "под чертой"],
  [ // [предмет, препод, аудитория]
    ["--", "", ""], //понедельник
    ["л. ЭМ", "Тодарев В.В.", ""],
    ["лаб. СПТ", "Погуляев М.Н.", ""],
    ["л. СПТ", "Погуляев М.Н.", ""],
    ["--", "", ""],
  ],
  [
    ["--", "", ""], //вторник
    ["--", "", ""],
    ["пр. ПС", "Погуляев М.Н.", ""],
    ["пр. ПрМех", "Иноземцева Н.В.", ""],
    ["лаб. ПС", "Погуляев М.Н.", ""],
  ],
  [
    ["лаб. ТОЭ", "Соленков В.В.", ""],
    ["л. ТОЭ", "Соленков В.В.", ""],
    ["пр. СПТ", "Погуляев М.Н.", ""],
    ["пр. ЭМ", "Тодарев В.В.", ""],
    ["--", "", ""],
  ],
  [
    ["--", "", ""], //четверг
    ["лаб. Охрана труда", "Веппер Л.В.", ""],
    ["л. ППСТ", "Погуляев М.Н.", ""],
    ["л. ПрМех", "Иноземцева Н.В.", ""],
    ["пр. Экономика", "Савенко Т.В.", ""],
  ],
  [
    ["--", "", ""], //пятница
    ["--", "", ""],
    ["л. Экономика", "Савенко Т.В.", ""],
    ["л. Охрана труда", "Веппер Л.В.", ""],
    ["--", "", ""],
  ],
  [
    ["О", "", ""], //суббота
    ["Т", "", ""],
    ["Д", "", ""],
    ["Ы", "", ""],
    ["Х", "", ""],
  ]
];


/*var alarms = [
  [8, 00, 0],
  [9, 30, -1], //1

  [9, 45, 1],
  [11, 15, -1], //2

  [11, 25, 2],
  [12, 55, -1], //3

  [13, 25, 3],
  [14, 55, -1], //4

  [15, 05, 4],
  [16, 35, "undefined"] //5
];*/
