var tsnad = [
  ["ЭП-21 / 1", "над чертой"],
  [ // [предмет, препод, аудитория]
    ["--", "--", "--"], //понедельник
    ["л. ЭМ", "Тодарев В.В.", "2-230"],
    ["лаб. ЭМ", "Тодарев В.В.", "2-230"],
    ["л. СПТ", "Погуляев М.Н.", "2-230"],
    ["--", "--", "--"],
  ],
  [
    ["--", "--", "--"], //вторник
    ["ФИЗРА", "--", "--"],
    ["л. ЭМ", "Тодарев В.В.", "2-230"],
    ["пр. ПрМех", "Иноземцева Н.В.", "1-428"],
    ["--", "--", "--"],
  ],
  [
    ["--", "--", "--"],
    ["л. ТОЭ", "Соленков В.В.", "2-14"],
    ["л. СПТ", "Погуляев М.Н.", "2-230"],
    ["--", "--", "--"],
    ["--", "--", "--"],
  ],
  [
    ["лаб. ТОЭ", "Соленков В.В.", "2-405"], //четверг
    ["пр. ТОЭ", "Соленков В.В.", "2-405"],
    ["л. ППСТ", "Погуляев М.Н.", "2-504"],
    ["л. ПрМех", "Иноземцева Н.В.", "1-423"],
    ["пр. Экономика", "Савенко Т.В.", "2-437"],
  ],
  [
    ["--", "--", "--"], //пятница
    ["ФИЗРА", "--", "--"],
    ["л. Экономика", "Савенко Т.В.", "2-14"],
    ["л. Охрана труда", "Веппер Л.В.", "2-226"],
    ["--", "--", "--"],
  ],
  [
    ["--", "--", "--"], //суббота
    ["--", "--", "--"],
    ["--", "--", "--"],
    ["--", "--", "--"],
    ["--", "--", "--"],
  ]
];

var tspod = [
  ["ЭП-21 / 1", "под чертой"],
  [ // [предмет, препод, аудитория]
    ["--", "--", "--"], //понедельник
    ["л. ЭМ", "Тодарев В.В.", "2-230"],
    ["лаб. СПТ", "Погуляев М.Н.", "2-220"],
    ["л. СПТ", "Погуляев М.Н.", "2-230"],
    ["--", "--", "--"],
  ],
  [
    ["--", "--", "--"], //вторник
    ["ФИЗРА", "--", "--"],
    ["пр. ПС", "Погуляев М.Н.", "2-229"],
    ["пр. ПрМех", "Иноземцева Н.В.", "1-428"],
    ["лаб. ПС", "Погуляев М.Н.", "2-230"],
  ],
  [
    ["лаб. ТОЭ", "Соленков В.В.", "2-405"],
    ["л. ТОЭ", "Соленков В.В.", "2-14"],
    ["пр. СПТ", "Погуляев М.Н.", "2-230"],
    ["пр. ЭМ", "Тодарев В.В.", "2-230"],
    ["--", "--", "--"],
  ],
  [
    ["--", "--", "--"], //четверг
    ["лаб. Охрана труда", "Веппер Л.В.", "2-226"],
    ["л. ППСТ", "Погуляев М.Н.", "2-230"],
    ["л. ПрМех", "Иноземцева Н.В.", "1-423"],
    ["пр. Экономика", "Савенко Т.В.", "2-437"],
  ],
  [
    ["--", "--", "--"], //пятница
    ["ФИЗРА", "--", "--"],
    ["л. Экономика", "Савенко Т.В.", "2-14"],
    ["л. Охрана труда", "Веппер Л.В.", "2-226"],
    ["--", "--", "--"],
  ],
  [
    ["--", "--", "--"], //суббота
    ["--", "--", "--"],
    ["--", "--", "--"],
    ["--", "--", "--"],
    ["--", "--", "--"],
  ]
];


/*var alarms = [
  [8, 00, 0],
  [9, 30, -1], //1

  [9, 45, 1],
  [11, 15, -1], //2

  [11, 25, 2],
  [12, 55, -1], //3

  [13, 25, 3],
  [14, 55, -1], //4

  [15, 05, 4],
  [16, 35, "undefined"] //5
];*/
